In [1]:
import pandas as pd
import numpy as np

In [2]:
city_revenues = pd.Series([4200,8000,6500],index=["Amsterdam","Toronto","Tokyo"])

city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [3]:
"Amsterdam" in city_revenues

True

In [4]:
city_revenues["Amsterdam"]

4200

In [5]:
city_revenues[0]

4200

In [6]:
city_revenues[-1]

6500

In [7]:
city_revenues[1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [8]:
city_count = pd.Series({"Jakarta" : 7,"Bandung":10})

city_count

Jakarta     7
Bandung    10
dtype: int64

In [9]:
print(city_count.keys())
print(city_count.values)

Index(['Jakarta', 'Bandung'], dtype='object')
[ 7 10]

In [10]:
city_data = pd.DataFrame({"Revenue" : city_revenues, "Employee Count":city_count})

city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

In [11]:
print(city_data.index)
print(city_data.values)
print(city_data.axes[0])
print(city_data.axes[1])
print(city_data.keys())

Index(['Amsterdam', 'Bandung', 'Jakarta', 'Tokyo', 'Toronto'], dtype='object')
[[4.2e+03     nan]
 [    nan 1.0e+01]
 [    nan 7.0e+00]
 [6.5e+03     nan]
 [8.0e+03     nan]]
Index(['Amsterdam', 'Bandung', 'Jakarta', 'Tokyo', 'Toronto'], dtype='object')
Index(['Revenue', 'Employee Count'], dtype='object')
Index(['Revenue', 'Employee Count'], dtype='object')

In [12]:
warna = pd.Series(["red","blue","green","yellow","black"],index=[1,2,3,4,5])

warna

1       red
2      blue
3     green
4    yellow
5     black
dtype: object

In [13]:
warna[1]

'red'

In [14]:
warna.loc[1]

'red'

In [15]:
warna.iloc[1]

'blue'

In [16]:
warna.iloc[1:]

2      blue
3     green
4    yellow
5     black
dtype: object

In [17]:
warna.iloc[:2]

1     red
2    blue
dtype: object

In [18]:
warna.iloc[-1]

'black'

In [19]:
warna.loc[1:3]

1      red
2     blue
3    green
dtype: object

In [20]:
city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

In [21]:
city_data["Revenue"]

Amsterdam    4200.0
Bandung         NaN
Jakarta         NaN
Tokyo        6500.0
Toronto      8000.0
Name: Revenue, dtype: float64

In [22]:
city_data.Revenue

Amsterdam    4200.0
Bandung         NaN
Jakarta         NaN
Tokyo        6500.0
Toronto      8000.0
Name: Revenue, dtype: float64

In [23]:
mainan = ([{"name" : "ball", "shape" : "sphere"},{"rubick" : "cube"}])

mainan

[{'name': 'ball', 'shape': 'sphere'}, {'rubick': 'cube'}]

In [24]:
city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

In [25]:
city_data.loc["Bandung"]

Revenue            NaN
Employee Count    10.0
Name: Bandung, dtype: float64

In [26]:
city_data.loc["Bandung" : "Toronto"]

         Revenue  Employee Count
Bandung      NaN            10.0
Jakarta      NaN             7.0
Tokyo     6500.0             NaN
Toronto   8000.0             NaN

In [27]:
city_data.loc["Bandung" :"Toronto", "Employee Count"]

Bandung    10.0
Jakarta     7.0
Tokyo       NaN
Toronto     NaN
Name: Employee Count, dtype: float64

In [28]:
city_data.iloc[1]

Revenue            NaN
Employee Count    10.0
Name: Bandung, dtype: float64

In [29]:
city_data.iloc[2:]

         Revenue  Employee Count
Jakarta      NaN             7.0
Tokyo     6500.0             NaN
Toronto   8000.0             NaN

In [30]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [31]:
city_revenues.max()

8000

In [32]:
city_revenues.min()

4200

In [33]:
city_revenues.sum()

18700

In [34]:
city_revenues.mean()

6233.333333333333

In [35]:
city_revenues.std()

1913.9836293274125

In [36]:
city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

In [37]:
city_data.max()

Revenue           8000.0
Employee Count      10.0
dtype: float64

In [38]:
city_data.min()

Revenue           4200.0
Employee Count       7.0
dtype: float64

In [39]:
city_data.sum()

Revenue           18700.0
Employee Count       17.0
dtype: float64

In [40]:
city_data.mean()

Revenue           6233.333333
Employee Count       8.500000
dtype: float64

In [41]:
city_data.std()

Revenue           1913.983629
Employee Count       2.121320
dtype: float64

In [42]:
city_data["Revenue"].sum()

18700.0

In [43]:
city_data["Revenue"].min()

4200.0

In [44]:
city_data["Revenue"].max()

8000.0

In [45]:
city_data["Revenue"].mean()

6233.333333333333

In [46]:
city_data["Revenue"].std()

1913.9836293274122

In [47]:
city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

In [48]:
city_data.loc["Amsterdam" : "Tokyo"].max()

Revenue           6500.0
Employee Count      10.0
dtype: float64

In [49]:
city_data.loc["Amsterdam" : "Tokyo"].min()

Revenue           4200.0
Employee Count       7.0
dtype: float64

In [50]:
city_data.loc["Amsterdam" : "Tokyo"].sum()

Revenue           10700.0
Employee Count       17.0
dtype: float64

In [51]:
city_data.loc["Amsterdam" : "Tokyo"].mean()

Revenue           5350.0
Employee Count       8.5
dtype: float64

In [52]:
city_data.loc["Amsterdam" : "Tokyo"].std()

Revenue           1626.345597
Employee Count       2.121320
dtype: float64

In [53]:
city_data.loc["Amsterdam" : "Tokyo", "Revenue"].sum()

10700.0

In [54]:
city_data.loc["Amsterdam" : "Tokyo", "Revenue"].max()

6500.0

In [55]:
city_data.loc["Amsterdam" : "Tokyo", "Revenue"].min()

4200.0

In [56]:
city_data.loc["Amsterdam" : "Tokyo", "Revenue"].mean()

5350.0

In [57]:
city_data.loc["Amsterdam" : "Tokyo", "Revenue"].std()

1626.3455967290593

In [58]:
city_data.loc["Amsterdam" : "Tokyo", "Revenue"].mean()

5350.0

In [59]:
data_stock = pd.DataFrame({"Product":["Smart TV", "Chrome Cast", "Speaker", "Earphone"],
                            "Opening Stock":[300,700,1200,1500],
                            "Closing Stock":[200,500,1000,900]})

data_stock

       Product  Opening Stock  Closing Stock
0     Smart TV            300            200
1  Chrome Cast            700            500
2      Speaker           1200           1000
3     Earphone           1500            900

In [60]:
res_values1 = np.where((data_stock["Opening Stock"]>=700) & (data_stock["Closing Stock"]<1000))

print(data_stock.loc[res_values1])

       Product  Opening Stock  Closing Stock
1  Chrome Cast            700            500
3     Earphone           1500            900

In [76]:
res_values1

(array([1, 3], dtype=int64),)

In [61]:
res_values2 = np.where((data_stock["Opening Stock"]>=500) & (data_stock["Closing Stock"]<1000) &
                data_stock["Product"].str.startswith("C"))

print(data_stock.loc[res_values2])

       Product  Opening Stock  Closing Stock
1  Chrome Cast            700            500

In [62]:
city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

# Combining Multiple Datasets

In [63]:
futher_city_data = pd.DataFrame({"Revenue":[7000,3400],"Employee Count":[2,2]},index=["New York", "Barcelona"])

futher_city_data

           Revenue  Employee Count
New York      7000               2
Barcelona     3400               2

In [64]:
city_data

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN

In [65]:
city_count

Jakarta     7
Bandung    10
dtype: int64

In [66]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [67]:
city_data_new = pd.concat([city_data,futher_city_data], sort=False)

city_data_new

           Revenue  Employee Count
Amsterdam   4200.0             NaN
Bandung        NaN            10.0
Jakarta        NaN             7.0
Tokyo       6500.0             NaN
Toronto     8000.0             NaN
New York    7000.0             2.0
Barcelona   3400.0             2.0

In [68]:
city_data_new2 = pd.concat([city_data,futher_city_data], sort=True)

city_data_new2

           Employee Count  Revenue
Amsterdam             NaN   4200.0
Bandung              10.0      NaN
Jakarta               7.0      NaN
Tokyo                 NaN   6500.0
Toronto               NaN   8000.0
New York              2.0   7000.0
Barcelona             2.0   3400.0

In [69]:
city_countries = pd.DataFrame({"Country": ["Holland","Indonesia","Indonesia","Japan","Holland","Canada","Spain",],
                            "Capital": [1,1,0,0,0,1,1]},
                            index=["Amsterdam","Bandung","Jakarta","Tokyo","Rotterdam","Toronto","Barcelona"])

city_countries

             Country  Capital
Amsterdam    Holland        1
Bandung    Indonesia        1
Jakarta    Indonesia        0
Tokyo          Japan        0
Rotterdam    Holland        0
Toronto       Canada        1
Barcelona      Spain        1

In [70]:
data_kota = pd.concat([city_data,city_countries],axis=1,sort=False)

data_kota

           Revenue  Employee Count    Country  Capital
Amsterdam   4200.0             NaN    Holland        1
Bandung        NaN            10.0  Indonesia        1
Jakarta        NaN             7.0  Indonesia        0
Tokyo       6500.0             NaN      Japan        0
Toronto     8000.0             NaN     Canada        1
Rotterdam      NaN             NaN    Holland        0
Barcelona      NaN             NaN      Spain        1

In [71]:
pd.concat([city_data,city_countries],axis=1,join="inner")

           Revenue  Employee Count    Country  Capital
Amsterdam   4200.0             NaN    Holland        1
Bandung        NaN            10.0  Indonesia        1
Jakarta        NaN             7.0  Indonesia        0
Tokyo       6500.0             NaN      Japan        0
Toronto     8000.0             NaN     Canada        1

In [72]:
negara = pd.DataFrame({"population_millions": [17, 127, 37],"continent": ["Europe", "Asia", "North America"]},
                    index=["Holland", "Japan", "Canada"])

negara

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [73]:
data_kota

           Revenue  Employee Count    Country  Capital
Amsterdam   4200.0             NaN    Holland        1
Bandung        NaN            10.0  Indonesia        1
Jakarta        NaN             7.0  Indonesia        0
Tokyo       6500.0             NaN      Japan        0
Toronto     8000.0             NaN     Canada        1
Rotterdam      NaN             NaN    Holland        0
Barcelona      NaN             NaN      Spain        1

In [74]:
data_gabung = pd.merge(data_kota,negara,left_on="Country",right_index=True)

data_gabung

,Revenue,Employee Count,Country,Capital,population_millions,continent
Amsterdam,4200.0,NaN,Holland,1,17,Europe
Rotterdam,NaN,NaN,Holland,0,17,Europe
Tokyo,6500.0,NaN,Japan,0,127,Asia
Toronto,8000.0,NaN,Canada,1,37,North America

In [75]:
data_gabung_semua = pd.merge(data_kota,negara,left_on="Country",right_index=True,how="left")

data_gabung_semua

,Revenue,Employee Count,Country,Capital,population_millions,continent
Amsterdam,4200.0,NaN,Holland,1,17.0,Europe
Bandung,NaN,10.0,Indonesia,1,NaN,NaN
Jakarta,NaN,7.0,Indonesia,0,NaN,NaN
Tokyo,6500.0,NaN,Japan,0,127.0,Asia
Toronto,8000.0,NaN,Canada,1,37.0,North America
Rotterdam,NaN,NaN,Holland,0,17.0,Europe
Barcelona,NaN,NaN,Spain,1,NaN,NaN